# Merge, Join, & Concatenate Operations
* Pandas provides powerful tools for combining DataFrames, including merging, joining, and concatenating.
* These operations are essential for data analysis and manipulation tasks.

In [8]:
import pandas as pd

# Creating a dictionary with employee details
data1 = {"EMPID":["E1","E2","E3","E4","E5","E6"],
        "Name": ["Ram", "Lakshman", "Bharat", "Shatrughan", "Luv", "Kush"],
        "Age": [28,26,24,22,8,6] }

# Creating a dictionary with employee salary details
data2 = {"EMPID":["E1","E2","E3","E4","E5","E6"],
        "Salary": [65000,60000,57000,52000,38000,32000]}

# Converting the first dictionary into a DataFrame
df1 = pd.DataFrame(data1)

# Converting the second dictionary into a DataFrame
df2 = pd.DataFrame(data2)

print(df1)
print()
print(df2)

  EMPID        Name  Age
0    E1         Ram   28
1    E2    Lakshman   26
2    E3      Bharat   24
3    E4  Shatrughan   22
4    E5         Luv    8
5    E6        Kush    6

  EMPID  Salary
0    E1   65000
1    E2   60000
2    E3   57000
3    E4   52000
4    E5   38000
5    E6   32000

# Merging
*Merging combines DataFrames based on a common column or index. It's similar to SQL joins.

In [10]:
# Merge df1 and df2 DataFrames on the 'EMPID' column and store the result in merged_df
merged_df = pd.merge(df1, df2, on="EMPID")
print(merged_df)

print()

# Print the result of merging df1 and df2 on the 'EMPID' column directly
print(pd.merge(df1,df2, on = "EMPID"))

  EMPID        Name  Age  Salary
0    E1         Ram   28   65000
1    E2    Lakshman   26   60000
2    E3      Bharat   24   57000
3    E4  Shatrughan   22   52000
4    E5         Luv    8   38000
5    E6        Kush    6   32000

  EMPID        Name  Age  Salary
0    E1         Ram   28   65000
1    E2    Lakshman   26   60000
2    E3      Bharat   24   57000
3    E4  Shatrughan   22   52000
4    E5         Luv    8   38000
5    E6        Kush    6   32000

In [12]:
data3 = {"EMPID":["E1","E2","E3","E4","E5","E6"],
        "Name": ["Ram", "Lakshman", "Bharat", "Shatrughan", "Luv", "Kush"],
        "Age": [28,26,24,22,8,6] }

data4 = {"EMPID":["E1","E7","E3","E8","E5","E6"],
        "Salary": [65000,60000,57000,52000,38000,32000]}

df3 = pd.DataFrame(data3)
df4 = pd.DataFrame(data4)

print(df3)
print()
print(df4)

  EMPID        Name  Age
0    E1         Ram   28
1    E2    Lakshman   26
2    E3      Bharat   24
3    E4  Shatrughan   22
4    E5         Luv    8
5    E6        Kush    6

  EMPID  Salary
0    E1   65000
1    E7   60000
2    E3   57000
3    E8   52000
4    E5   38000
5    E6   32000

# Joining
* Inner Join: Returns rows that have matching values in both DataFrames.
* Left Join: Returns all rows from the left DataFrame and the matching rows from the right DataFrame.
* Right Join: Returns all rows from the right DataFrame and the matching rows from the left DataFrame.
* Outer Join: Returns all rows from both DataFrames.

In [22]:
# JOINS

# Merge df3 and df4 based on the common column "EMPID"
print(pd.merge(df3,df4, on = "EMPID"))   # This is a simple inner join by default
print()

# Explicitly specify an inner join
print(pd.merge(left = df3, right = df4, on = "EMPID", how = "inner"))
print()

# Perform a right join, keeping all rows from df4 and matching rows from df3
print(pd.merge(left = df3, right = df4, on = "EMPID", how = "right"))
print()

# Perform a left join, keeping all rows from df3 and matching rows from df4
print(pd.merge(left = df3, right = df4, on = "EMPID", how = "left"))
print()

# Perform an Outer join, Returns all rows from both DataFrames df3 and df4
print(pd.merge(df3, df4, on='EMPID', how='outer'))

  EMPID    Name  Age  Salary
0    E1     Ram   28   65000
1    E3  Bharat   24   57000
2    E5     Luv    8   38000
3    E6    Kush    6   32000

  EMPID    Name  Age  Salary
0    E1     Ram   28   65000
1    E3  Bharat   24   57000
2    E5     Luv    8   38000
3    E6    Kush    6   32000

  EMPID    Name   Age  Salary
0    E1     Ram  28.0   65000
1    E7     NaN   NaN   60000
2    E3  Bharat  24.0   57000
3    E8     NaN   NaN   52000
4    E5     Luv   8.0   38000
5    E6    Kush   6.0   32000

  EMPID        Name  Age   Salary
0    E1         Ram   28  65000.0
1    E2    Lakshman   26      NaN
2    E3      Bharat   24  57000.0
3    E4  Shatrughan   22      NaN
4    E5         Luv    8  38000.0
5    E6        Kush    6  32000.0

  EMPID        Name   Age   Salary
0    E1         Ram  28.0  65000.0
1    E2    Lakshman  26.0      NaN
2    E3      Bharat  24.0  57000.0
3    E4  Shatrughan  22.0      NaN
4    E5         Luv   8.0  38000.0
5    E6        Kush   6.0  32000.0
6    E7         NaN   NaN  60000.0
7    E8         NaN   NaN  52000.0

# Concatenating
* Concatenation combines DataFrames along a specified axis (rows or columns).

In [25]:
data5 = {"EMPID":["E1","E2","E3","E4","E5","E6"],
        "Name": ["Ram", "Lakshman", "Bharat", "Shatrughan", "Luv", "Kush"],
        "Age": [28,26,24,22,8,6] }

data6 = {"EMPID":["E7","E8","E9","E10","E11","E12"],
         "Name": ["Stefan", "Damon", "Klaus", "Elijah", "Matt", "Tyler"],
         "Age": [28,26,24,22,8,6]}

df5 = pd.DataFrame(data5)
df6 = pd.DataFrame(data6)

print(df5)
print()
print(df6)

  EMPID        Name  Age
0    E1         Ram   28
1    E2    Lakshman   26
2    E3      Bharat   24
3    E4  Shatrughan   22
4    E5         Luv    8
5    E6        Kush    6

  EMPID    Name  Age
0    E7  Stefan   28
1    E8   Damon   26
2    E9   Klaus   24
3   E10  Elijah   22
4   E11    Matt    8
5   E12   Tyler    6

In [54]:
pd.concat([df5,df6])

  EMPID        Name  Age
0    E1         Ram   28
1    E2    Lakshman   26
2    E3      Bharat   24
3    E4  Shatrughan   22
4    E5         Luv    8
5    E6        Kush    6
0    E7      Stefan   28
1    E8       Damon   26
2    E9       Klaus   24
3   E10      Elijah   22
4   E11        Matt    8
5   E12       Tyler    6